ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type1.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32H7xx/hal_lld_type1.h
 * @brief   STM32H7xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          - STM32_VDD (as hundredths of Volt).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32H743xx, STM32H753xx very high-performance MCUs.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_TYPE1_H
#define HAL_LLD_TYPE1_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Platform identification macros
 * @{
 */
#if defined(STM32H742xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H742 Single Core Very High Performance with DSP and FPU"

#elif defined(STM32H743xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H743 Single Core Very High Performance with DSP and FPU"

#elif defined(STM32H753xx)
#define PLATFORM_NAME           "STM32H753 Single Core Very High Performance with DSP and FPU"

#elif defined(STM32H745xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H745 Dual Core Very High Performance with DSP and FPU"

#elif defined(STM32H755xx)
#define PLATFORM_NAME           "STM32H755 Dual Core Very High Performance with DSP and FPU"

#elif defined(STM32H747xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H747 Dual Core Very High Performance with DSP and FPU"

#elif defined(STM32H757xx)
#define PLATFORM_NAME           "STM32H757 Dual Core Very High Performance with DSP and FPU"

#elif defined(STM32H750xx)
#define PLATFORM_NAME           "STM32H750 Value Line Very High Performance with DSP and FPU"

#else
#error "STM32H7xx device not specified"
#endif
/** @} */

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
#if !defined(STM32_ENFORCE_H7_REV_XY)
/**
 * @brief   Absolute maximum system clock.
 */
#define STM32_SYSCLK_MAX                480000000

/**
 * @brief   Maximum SYSCLK clock frequency without voltage boost.
 */
#define STM32_SYSCLK_MAX_NOBOOST        400000000

/**
 * @brief   Absolute maximum HCLK clock.
 */
#define STM32_HCLK_MAX                  (STM32_SYSCLK_MAX / 2)

/**
 * @brief   Maximum HSE clock frequency.
 */
#define STM32_HSECLK_MAX                48000000

/**
 * @brief   Maximum HSE clock frequency using an external source.
 */
#define STM32_HSECLK_BYP_MAX            50000000

/**
 * @brief   Minimum HSE clock frequency.
 */
#define STM32_HSECLK_MIN                4000000

/**
 * @brief   Minimum HSE clock frequency.
 */
#define STM32_HSECLK_BYP_MIN            4000000

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSE_CK_MAX                32768

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSE_CK_BYP_MAX            1000000

/**
 * @brief   Minimum LSE clock frequency.
 */
#define STM32_LSE_CK_MIN                32768

/**
 * @brief   Minimum PLLs input clock frequency..
 */
#define STM32_PLLIN_MIN                 1000000

/**
 * @brief   PLLs input threshold frequency 1.
 */
#define STM32_PLLIN_THRESHOLD1          2000000

/**
 * @brief   PLLs input threshold frequency 2.
 */
#define STM32_PLLIN_THRESHOLD2          4000000

/**
 * @brief   PLLs input threshold frequency 3.
 */
#define STM32_PLLIN_THRESHOLD3          8000000

/**
 * @brief   Maximum PLLs input clock frequency.
 */
#define STM32_PLLIN_MAX                 16000000

/**
 * @brief   Minimum PLLs VCO clock frequency.
 */
#define STM32_PLLVCO_MIN                150000000   /* DS says 192, RM says 150.    */

/**
 * @brief   Threshold PLLs clock frequency.
 */
#define STM32_PLLVCO_THRESHOLD          420000000

/**
 * @brief   Maximum PLLs VCOH clock frequency.
 */
#define STM32_PLLVCO_MAX                960000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define STM32_PCLK1_MAX                 (STM32_HCLK_MAX / 2)

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define STM32_PCLK2_MAX                 (STM32_HCLK_MAX / 2)

/**
 * @brief   Maximum APB3 clock frequency.
 */
#define STM32_PCLK3_MAX                 (STM32_HCLK_MAX / 2)

/**
 * @brief   Maximum APB4 clock frequency.
 */
#define STM32_PCLK4_MAX                 (STM32_HCLK_MAX / 2)

/**
 * @brief   Maximum SPI1, SPI2 and SPI3 clock frequency.
 */
#define STM32_SPI123_MAX                200000000

/**
 * @brief   Maximum SPI4, SPI5 and SPI6 clock frequency.
 */
#define STM32_SPI456_MAX                125000000

/**
 * @brief   Maximum ADC clock frequency.
 */
#define STM32_ADCCLK_MAX                50000000

#else /* defined(STM32_ENFORCE_H7_REV_XY) */

#define STM32_SYSCLK_MAX                400000000
#define STM32_SYSCLK_MAX_NOBOOST        400000000
#define STM32_HCLK_MAX                  (STM32_SYSCLK_MAX / 2)
#define STM32_HSECLK_MAX                48000000
#define STM32_HSECLK_BYP_MAX            50000000
#define STM32_HSECLK_MIN                4000000
#define STM32_HSECLK_BYP_MIN            4000000
#define STM32_LSE_CK_MAX                32768
#define STM32_LSE_CK_BYP_MAX            1000000
#define STM32_LSE_CK_MIN                32768
#define STM32_PLLIN_MIN                 1000000
#define STM32_PLLIN_THRESHOLD1          2000000
#define STM32_PLLIN_THRESHOLD2          4000000
#define STM32_PLLIN_THRESHOLD3          8000000
#define STM32_PLLIN_MAX                 16000000
#define STM32_PLLVCO_MIN                150000000
#define STM32_PLLVCO_THRESHOLD          420000000
#define STM32_PLLVCO_MAX                836000000
#define STM32_PCLK1_MAX                 (STM32_HCLK_MAX / 2)
#define STM32_PCLK2_MAX                 (STM32_HCLK_MAX / 2)
#define STM32_PCLK3_MAX                 (STM32_HCLK_MAX / 2)
#define STM32_PCLK4_MAX                 (STM32_HCLK_MAX / 2)
#define STM32_SPI123_MAX                133000000
#define STM32_SPI456_MAX                100000000
#define STM32_ADCCLK_MAX                36000000

#endif /* defined(STM32_ENFORCE_H7_REV_XY) */
/** @} */

/**
 * @name    Internal clock sources frequencies
 * @{
 */
#define STM32_HSI_OSC                   64000000
#define STM32_HSI48_OSC                 48000000
#define STM32_CSI_OSC                   4000000
#define STM32_LSI_OSC                   32000
/** @} */

/**
 * @name    Register helpers not found in ST headers
 * @{
 */
#define RCC_CR_HSIDIV_VALUE(n)          ((n) << 3U)

